SengPhirum/PLXY_DrowsyGuard/firmware/esp32s3/sdkconfig.defaults
# Baseline config for the ESP32-S3-WROOM-1 N16R8 CAM board.
# `idf.py set-target esp32s3` seeds sdkconfig from this file. Delete sdkconfig (not
# this file) if you want to start over.

CONFIG_IDF_TARGET="esp32s3"

# --- 16 MB flash ---
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- 8 MB octal PSRAM ---
# Non-negotiable: the camera framebuffers live here (CAMERA_FB_IN_PSRAM) and so do
# the ESP-DL models. Get MODE_OCT wrong and the board boots but finds 0 bytes of
# PSRAM, which surfaces later as an unexplained esp_camera_init() failure.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# --- performance ---
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y

# --- camera ---
CONFIG_OV3660_SUPPORT=y
CONFIG_OV2640_SUPPORT=y
CONFIG_CAMERA_TASK_STACK_SIZE=4096

# --- app ---
# app_main runs the capture loop directly, and BehaviorAnalyzer/Perclos keep a few
# KB of rolling buffers on the stack path.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# The camera + LCD current spike on a marginal USB cable trips the brownout
# detector mid-init. Lower the threshold rather than chasing phantom camera faults;
# raise it back for the final power-supply validation.
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_4=y
